Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེ་དག་གིས་འབད་པ་དང་བརྩལ་བས་བརྩོན་འགྲུས་བརྩམས་པས་འཁོར་བའི་འཁོར་ལོ་ཆ་ལྔ་པ་གཡོ་བ་དང་མི་གཡོ་བ་འདི་ཉིད་རིག་སྟེ། འདུ་བྱེད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཅེས་བྱ་བ་ནས་མངོན་དུ་སྨྲ་བར་བྱ་བར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Exerting themselves, endeavoring and striving, they came to understand saṃsāra’s ever-revolving five cycles, overthrew all conditioned states . . . and the five hundred ṛṣis became objects of veneration, respect, and praise for the gods including Indra and Upendra.

source: །དེ་དག་ལ་འདོམས་པར་བྱེད་པའི་དྲང་སྲོང་གང་ཡིན་པ་དེས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་ཆ་བྱད་འདིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་བསླུས་པ་དེ་དག་ཇེ་དད་པ་སྐྱེས་པར་བགྱིས་ལ་སླད་ཀྱིས་རབ་ཏུ་དབྱུང་བར་བགྱིའོ།
en: The ṛṣi who was their leader said, “Blessed One, I deceived many people in this guise. I will go forth after making the people’s faith arise.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དྲང་སྲོང་ལྔ་བརྒྱ་དང་སྔོན་གྱི་དགེ་སློང་རྣམས་ཀྱིས་ཟླ་བ་ཁམ་པ་ལྟ་བུར་བསྐོར་ནས་དེ་ཉིད་ནས་རྫུ་འཕྲུལ་གྱིས་སྟེང་གི་ནམ་མཁའ་ལས་གཤེགས་ཏེ་རིམ་གྱིས་གཏུན་རི་ལ་བྱོན་ཏོ།
en: Then the Blessed One, surrounded, in the shape of a half-moon, by the five hundred ṛṣis and monks who had been monks from the beginning, soared with them into the air from there using his magical power, and arrived in due course at Mount Musalaka.

source: །དེའི་ཚེ་གཏུན་རིལ་དྲང་སྲོང་ཤིང་གོས་ཅན་ཞེས་བྱ་བ་ཞིག་གནས་ཏེ། དྲང་སྲོང་དེས་བཅོམ་ལྡན་འདས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ་ཞེས་བྱ་བ་ནས། ཀུན་ནས་མཛེས་པ་རྒྱང་རིང་པོ་ཁོ་ན་ནས་མཐོང་ངོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: At that time there lived a ṛṣi on Mount Musalaka named Vakkalin. He saw the Blessed One, who was fully ornamented with the thirty-two marks of a great man . . . .

source: །མཐོང་མ་ཐག་ཏུ་དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་མངོན་པར་དད་པར་གྱུར་ཏེ། དེ་དད་པ་སྐྱེས་ནས་བསམས་པ། མ་ལ་བདག་རི་ལས་བབས་ཏེ།
en: As soon as Vakkalin saw the Blessed One, his mind was filled with faith in the Blessed One. When Vakkalin’s faith had arisen, he thought, “Now I will descend from the mountain and go to meet the Blessed One.

source: བཅོམ་ལྡན་འདས་བལྟ་ཞིང་འགྲོར་ནི་བཅོམ་ལྡན་འདས་གདུལ་བ་ལ་གཟིགས་པས་འདས་པར་འགྱུར་གྱིས།
en: The Blessed One may pass through here out of consideration for people to be trained.

source: མ་ལ་བདག་ཉིད་མཆོང་བར་བྱའོ་སྙམ་ནས།
en: Therefore, I will now throw myself off the mountain.”

source: དེས་རི་ལས་བདག་ཉིད་མཆོངས་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བསྙེལ་བ་མི་མངའ་བའི་ཆོས་ཅན་ཡིན་པས་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་བླངས་སོ།
en: Thinking thus, Vakkalin threw himself from the top of the mountain. Since the buddhas, the blessed ones, have a watchful nature, the Blessed One caught him with his magical power.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པའི་ཆོས་བཤད་པ་མཛད་དེ།
en: The Blessed One knew his thinking, proclivity, disposition, and nature and preached the Dharma that was appropriate for him.

source: དེ་ཐོས་ནས་ཤིང་གོས་ཅན་གྱིས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ་རྫུ་འཕྲུལ་མངོན་པར་བསྒྲུབས་ནས།
en: When Vakkalin had heard the Dharma, he actualized the fruit of a never-returner and achieved magical power.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བ་དང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན་ཞེས་བྱ་བ་ནས།
en: Then Vakkalin said to the Blessed One, “Honored One, I wish to go forth and be ordained a monk in the well-taught Dharma and Vinaya . . . .”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བས་རབ་ཏུ་ཕྱུང་ངོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་དགོངས་པས་ལུས་གཟུགས་བཀབ་པར་གྱུར་ཅེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: Then the Blessed One, saying “Come, monk,” . . . . . . . And his body swathed in the Buddha’s mind.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ངའི་དགེ་སློང་དད་པས་རྣམ་པར་གྲོལ་བ་རྣམས་ཀྱི་མཆོག་ནི་འདི་ཡིན་ཏེ། འདི་ལྟ་སྟེ་དགེ་སློང་ཤིང་གོས་ཅན་ནོ།
en: Then the Blessed One said to the monks, “Monks, it is he, the monk Vakkalin, who is the best of the monks who were emancipated by faith.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ། ཆོ་འཕྲུལ་རྣམ་པ་སྣ་ཚོགས་མཛད་ཅིང་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུར་གཤེགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: After that, the Blessed One, surrounded by a thousand monks, performing miracles, went to the city of Sūrpāraka.

source: གལ་ཏེ་སྒོ་གཅིག་ནས་ཞུགས་ན་གཞན་དག་གཞན་དུ་སེམས་པར་འགྱུར་བས་མ་ལ་ང་རྫུ་འཕྲུལ་ཁོ་ནས་འཇུག་པར་བྱའོ་སྙམ་ནས།
en: The Blessed One thought, “If I enter from one gate, those who are at the other gates will be disappointed. Thus, I will enter by using my magical power.”

source: དེ་ནས་རྫུ་འཕྲུལ་གྱིས་སྟེང་གི་ནམ་མཁའ་ལས་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུའི་དབུས་སུ་གཤེགས་སོ།
en: So the Blessed One entered the city of Sūrpāraka from the sky using his magical power.

source: །དེ་ནས་སློ་མ་ལྟ་བུའི་བདག་པོ་རྒྱལ་པོ་དང་། ཚེ་དང་ལྡན་པ་གང་པོ་དང་། ཤིང་གི་རྣ་ཆ་ཅན་དང་། རྒྱ་སྐེགས་ཀྱི་རྣ་ཆ་ཅན་དང་། ཞ་ཉེའི་རྣ་ཆ་ཅན་དང་། རྒྱལ་པོའི་སྲས་བཅུ་བདུན་པོ་དེ་དག་ཀྱང་རང་རང་གི་འཁོར་དང་། སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ངོ་།
en: Then the king, the ruler of Sūrpāraka, and the venerable Pūrṇa, Dārukarṇin, Stavakarṇin, and Trapukarṇin, as well as the seventeen princes, went to the Blessed One along with the attendants of each one and hundreds of thousands of other beings.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཞམ་རིང་བྱས་ཤིང་ཙན་དན་གྱི་ཕྲེང་བའི་ཁང་བཟངས་གང་ན་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་ཏེ།
en: After that, the Blessed One, accompanied by hundreds of thousands of beings, went to the palace garlanded with sandalwood and sat on the seat prepared for him in front of the community of monks.

source: སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་།
en: Since the large crowd could not see the Blessed One, the crowd started to destroy the palace garlanded with sandalwood.

source: །ཙན་དན་གྱི་ཕྲེང་བའི་ཁང་བཟངས་ཞིག་ལ་ཐུག་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། གལ་ཏེ་ཙན་དན་གྱི་ཕྲེང་བའི་ཁང་བཟངས་ཞིག་པར་གྱུར་ན་སྦྱིན་བདག་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་བར་ཆད་དུ་འགྱུར་གྱིས།
en: The Blessed One thought, “If the palace garlanded with sandalwood is destroyed, such destruction will decrease the donors’ merit.

source: མ་ལ་ངས་འདི་ཤེལ་གྱི་རང་བཞིན་དུ་སྤྲུལ་པར་བྱའོ་སྙམ་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ཇི་ལྟར་སྐྱེ་བོའི་ཚོགས་དེས་སངས་རྒྱས་ཀྱི་སྐུ་སྒྲིབ་པ་མེད་པར་མཐོང་བར་འགྱུར་བར་ཤེལ་གྱི་རང་བཞིན་དུ་སྤྲུལ་ཏོ།
en: Now I will transform this palace into a palace made of crystal.” The Blessed One transformed the palace into a palace made of crystal so that the large crowd could see the Buddha’s body without obstructions blocking the view.

source: །དེ་ནས་འཁོར་དེ་དག་གི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་འདྲ་བའི་ཆོས་བཤད་པ་མཛད་དེ།
en: The Blessed One knew the audience’s thinking, proclivities, dispositions, and natures, and so preached the Dharma that was appropriate for them.

source: དེ་ཐོས་ནས་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཁྱད་པར་ཆེན་པོ་དག་རྟོགས་ཏེ།
en: When the audience had heard the Dharma, hundreds of thousands of beings attained great excellence.

source: ཁ་ཅིག་གིས་ནི་ཐར་པའི་ཆ་དང་མཐུན་པའི་དགེ་བའི་རྩ་བ་བསྐྱེད། ཁ་ཅིག་གིས་ནི་ངེས་པར་འབྱེད་པའི་ཆ་དང་མཐུན་པ། ཁ་ཅིག་གིས་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས། ཁ་ཅིག་གིས་ནི་ལན་གཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ། ཁ་ཅིག་གིས་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ། ཁ་ཅིག་གིས་ནི་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་མངོན་སུམ་དུ་བྱས།
en: Some generated the roots of merit of liberation, some generated the roots of merit of penetration, some actualized the fruit of stream-entry, some the fruit of a never-returner, and some went forth, abandoned all the defilements, and actualized the state of an arhat.

source: ཁ་ཅིག་གིས་ནི་ཉན་ཐོས་ཀྱི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད། ཁ་ཅིག་གིས་ནི་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ། ཁ་ཅིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུའོ།
en: Some generated the intention for the awakening of disciples, some the intention for the awakening of a self-awakened one, and some the intention for complete and supreme awakening.

source: །འཁོར་དེ་ཕལ་ཆེར་སངས་རྒྱས་ལ་གཞོལ་བ་དང་། ཆོས་ལ་འབབ་པ་དང་། དགེ་འདུན་ལ་བབ་པར་བཀོད་དོ།
en: Most of the audience became absorbed in the Buddha, devoted to the Dharma, and inclined to the Saṅgha.

source: །དེ་ནས་ཤིང་གི་རྣ་ཆ་ཅན་དང་། རྒྱ་སྐེགས་ཀྱི་རྣ་ཆ་ཅན་དང་། ཞ་ཉེའི་རྣ་ཆ་ཅན་གྱིས་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་སྟ་གོན་བྱས་ནས་གདན་བཤམས་ཏེ། ནོར་བུའི་ཆུ་སྣོད་བཞག་ནས་བཅོམ་ལྡན་འདས་ལ་སྤྱན་འདྲེན་གྱིས་དུས་ཚོད་གསོལ་པ། བཙུན་པ་གདུགས་ཚོད་ལགས་ཤིང་མཆིས་ན།
en: Dārukarṇin, Stavakarṇin, and Trapukarṇin then prepared a pure and fine meal, arranged seats, set up a jeweled pitcher, and let the Blessed One know the time by messenger:

source: དེའི་ཚེ་ཀླུའི་རྒྱལ་པོ་ནག་པོ་དང་། གཽ་ཏ་མ་ཞེས་བྱ་བ་རྒྱ་མཚོ་ཆེན་པོ་ན་གནས་པ་དེ་གཉིས་ཀྱིས་བསམས་པ།
en: At that time there lived in the great ocean two nāga kings named Kṛṣṇa and Gautama.

source: བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུ་ན་ཆོས་འཆད་ཀྱིས་དོང་ལ་མཉན་པར་བྱའོ་སྙམ་མོ། །དེ་ནས་དེ་གཉིས་ཀླུ་ལྔ་བརྒྱའི་འཁོར་དང་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུར་ཆུ་བོ་ལྔ་བརྒྱ་ཕབ་ནས་ཆས་སོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བསྙེལ་བ་མི་མངའ་བའི་ཆོས་ཅན་ཡིན་པས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: They both thought, “Since the Blessed One is preaching the Dharma in the city of Sūrpāraka, let’s go to listen to the Dharma.” Then they both, along with five hundred nāga attendants, departed for the city of Sūrpāraka, creating five hundred rivers flowing toward the city.

source: ཀླུའི་རྒྱལ་པོ་ནག་པོ་དང་། གཽ་ཏ་མ་འདི་གཉིས་གལ་ཏེ་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུར་འོངས་པར་གྱུར་ན། ཡུལ་ཕུང་བར་བྱེད་པར་འགྱུར་རོ་སྙམ་ནས། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་དེ་བཞིན་གཤེགས་པའི་རིངས་པའི་བསོད་སྙོམས་ལོང་ཤིག །མཽད་གལ་གྱི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Since the buddhas, the blessed ones, have a watchful nature, the Blessed One thought, “If these two nāga kings, Kṛṣṇa and Gautama, come to the city of Sūrpāraka, they will ruin the country.” The Blessed One then said to the venerable Mahā­maudgalyāyana, “Maudgalyāyana, accept the alms requiring haste by the Tathāgata. Why, Maudgalyāyana?

source: རིངས་པའི་བསོད་སྙོམས་ནི་ལྔ་སྟེ། ལྔ་གང་ཞེ་ན།
en: Because there are five kinds of alms requiring haste. What are the five?

source: གློ་བུར་བ་དང་། འགྲོ་བར་ཆས་པ་དང་། ནད་པ་དང་། ནད་གཡོག་དང་། དགེ་སྐོས་སོ།
en: The almsfood of temporary visitors, of those who are setting forth on a journey, of sick people, of those attending the sick, and of monks responsible for monastic property.”

source: །སྐབས་འདིར་ནི་བཅོམ་ལྡན་འདས་དགེ་སྐོས་སུ་དགོངས་ཏེ།
en: In this situation, the Blessed One intended that the venerable Mahā­maudgalyāyana would be the monk who was responsible for monastic property.

source: བཅོམ་ལྡན་འདས་རྫུ་འཕྲུལ་གྱིས་དེ་ཉིད་ནས་སྟེང་གི་ནམ་མཁའ་ལས་གཤེགས་སོ།
en: The Blessed One soared up into the air from there, using his magical power.

source: །བཅོམ་ལྡན་འདས་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཀླུའི་རྒྱལ་པོ་ནག་པོ་དང་། གཽ་ཏ་མ་གང་ན་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་བཀའ་སྩལ་པ།
en: The two, the Blessed One and the venerable Mahā­maudgalyāyana, went to the nāga kings Kṛṣṇa and Gautama.

source: ཀླུའི་དབང་པོ་གྲོང་ཁྱེར་སློ་མ་ལྟ་བུ་ལ་སོམས་ལ་ཡུལ་ཕུང་བར་མ་བྱ་ཤིག །དེ་གཉིས་ཀྱིས་གསོལ་པ།
en: When the Blessed One and the venerable Mahā­maudgalyāyana had arrived, the Blessed One said, “Lords of nāgas, you should be attentive to the city of Sūrpāraka, and you should not destroy the country.”

source: བཙུན་པ་བདག་ཅག་གང་སྲོག་ཆགས་གྲོག་སྦུར་ལ་ཡང་གནོད་པ་མི་བགྱིད་པ་དེ་ལྟ་བུའི་དད་པས་མཆིས་ན། སློ་མ་ལྟ་བུ་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ལ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: “Honored One,” said the nāga kings, “we have come here with faith, because of which we never harm any beings, even ants, to say nothing of the people living in the city of Sūrpāraka.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་ནག་པོ་དང་། གཽ་ཏ་མ་ལ་དེ་ལྟ་བུའི་ཆོས་བཤད་པ་མཛད་དེ། དེ་ཐོས་ནས་སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་སོང་ཞིང་བསླབ་པའི་གཞི་རྣམས་བཟུང་ངོ་།
en: After that, the Blessed One preached the Dharma to the nāga kings Kṛṣṇa and Gautama, the hearing of which caused them to seek refuge in the Buddha, Dharma, and Saṅgha, and to accept the rules of training.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཞལ་ཟས་གསོལ་བའི་མཛད་པ་བརྩམས་པ་དང་། ཀླུ་རེ་རེ་ནས་བསམས་པ། ཀྱེ་མའོ་བཅོམ་ལྡན་འདས་ལ་བདག་གི་ཆུའི་བཏུང་བ་གསོལ་ལོ་སྙམ་མོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: When the Blessed One had begun his meal, each nāga thought, “Ah, may the Blessed One drink my water!”

source: གལ་ཏེ་གཅིག་གི་ཆུ་གསོལ་ན་ནི་དེས་ན་གཞན་དག་གཞན་དུ་སེམས་པར་འགྱུར་བས་ཐབས་ཤིག་བཤམ་པར་བྱའོ་སྙམ་དུ་དགོངས་ནས།
en: The Blessed One thought, “If I drink water from only one individual, it will disappoint the others. Therefore, I must devise a plan to drink the water of everyone.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་སོང་ལ་གང་ན་ཆུ་བོ་ལྔ་བརྒྱ་འདྲེས་པ་དེ་ལས་ཆུ་ལྷུང་བཟེད་ཁོང་ལ་ཁྱེར་ཏེ་ཤོག་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས།
en: Then the Blessed One instructed the venerable Mahā­maudgalyāyana, “Maudgalyāyana, go and bring water from the very point where the five hundred rivers meet.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས་གང་དུ་ཆུ་བོ་ལྔ་བརྒྱ་འདྲེས་པ་དེ་ནས་ཆུས་ལྷུང་བཟེད་བཀང་ནས་ཁྱེར་ཏེ།
en: “Certainly, O Honored One,” replied the venerable Mahā­maudgalyāyana, and he filled a bowl with water at the very point where the five hundred rivers met and returned to the Blessed One, bringing the water with him.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ལ་ལྷུང་བཟེད་བཀང་བའི་ཆུ་ཕུལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཞེས་ཏེ་གསོལ་ལོ།
en: When he arrived, the venerable Mahā­maudgalyāyana offered the bowl of water to the Blessed One, and the Blessed One accepted the water and drank it.

source: །ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བསམས་པ་བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་གྱི་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཕ་དང་མས་ནི་བུ་གསོས། བསྲིངས་བསྐྱེད་ནུ་མས་བསྣུན། འཛམ་བུའི་གླིང་གི་སྣ་ཚོགས་སྟོན་པར་བྱེད་པ་ཡིན་པས་ཤིན་ཏུ་དཀའ་བ་བྱེད་པ་སྟེ།
en: The venerable Mahā­maudgalyāyana thought, “The Blessed One once said, ‘Monks, fathers and mothers do what is quite difficult to do because they nourish their children, raise them, bring them up, feed them, and teach them everything on the continent of Jambu.

source: བུས་ཕྲག་པ་གཅིག་ལ་ནི་མ་བཞག་ཅིག་ཤོས་ལ་ནི་ཕ་བཞག་ནས་ལོ་བརྒྱ་ཚང་བར་ཁུར་དུ་ཐོགས་སམ།
en: Even if a son should try to carry his parents, his mother on one shoulder and his father on the other, for a hundred years;

source: ས་ཆེན་པོ་འདིའི་ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། གསེར་དང་། རྡོའི་སྙིང་པོ་དང་། སྤུག་དང་། པད་མ་རཱ་ག་དང་། དུང་གཡས་སུ་འཁྱིལ་པ་སྟེ།
en: if he should give them the earth’s jewels, pearls, lapis lazuli, glass, coral, silver, gold, agate, amber, ruby, and shells;

source: དེ་ལྟ་བུའི་དབང་ཕྱུག་ལ་བདག་པོར་བཅུག་ཀྱང་། བུས་ཕ་མ་ལ་དེ་ཙམ་གྱིས་ཕན་ཐོགས་པའམ་ལན་ལོན་པར་མི་འགྱུར་གྱི།
en: or if he should put his parents in a position of power, the son cannot truly help or sufficiently repay his father and mother with such efforts.

source: གང་གིས་ཕ་མ་དད་པ་མེད་པ་དད་པ་ཕུན་སུམ་ཚོགས་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ལ་འདུལ་ཞིང་འཛུད་དེ་སོ་སོར་འགོད་པར་བྱེད་པ་དང་། ཚུལ་ཁྲིམས་འཆལ་པ་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་དང་། སེར་སྣ་ཅན་གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་དང་། ཤེས་རབ་འཆལ་པ།
en: If a person motivates his parents to have complete faith, and leads them to, leads them to enter into, and leads them to stand safely in their faith when they do not have faith; if he motivates them to have completely good conduct when they have disordered conduct; if he motivates them to be completely generous when they are ungenerous;

source: ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ལ་འདུལ་ཞིང་འཛུད་དེ་སོ་སོར་འགོད་པར་བྱེད་ན། དེ་ཙམ་གྱིས་བུས་ཕ་དང་མ་ལ་ཕན་ཐོགས་པ་དང་ལན་ལོན་པ་ཡིན་ནོ་ཞེས་གསུངས་ན། བདག་གིས་ནི་མ་ལ་ལན་གཅིག་ཡང་མ་ལོན་གྱིས།
en: if he motivates them to have complete intelligence, and leads them to, leads them to enter into, and leads them to stand safely in their intelligence when they have disordered intelligence, he comes to truly help and repay his father and mother with just such efforts.’ Since I have not yet repaid my mother, now I will consider where my mother has been reborn.”

source: མ་ལ་བདག་གིས་བདག་གི་མ་གང་དུ་སྐྱེས་པ་བསམ་མོ་སྙམ་ནས་བསམ་པ་ལ་ཞུགས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་ཅན་དུ་སྐྱེས་པར་མཐོང་ངོ་།
en: When the venerable Mahā­maudgalyāyana considered this, he found that she had been reborn in the Marīcika world.

source: །དེས་དེ་སུའི་གདུལ་བྱ་ཡིན་པ་བརྟགས་ན། བཅོམ་ལྡན་འདས་ཀྱི་ཡིན་པར་མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then he observed by whom she should be trained and found that it was the Blessed One.

source: བདག་ལམ་རིང་པོ་ནས་འདིར་འོངས་པས་ཅི་ནས་ཀྱང་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་དོན་འདི་གསོལ་ལོ་སྙམ་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་དགེ་སློང་དག་ཕ་དང་མ་ནི་བུ་ལ་ཤིན་དུ་དཀའ་བ་བྱེད་པ་ཡིན་ནོ་ཞེས་གསུངས་ན། བདག་གི་མ་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་ཅན་དུ་སྐྱེས་ཏེ། དེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་འདུལ་བར་འགྱུར་ལགས་ན།
en: He thought, “Since I have come here from a distance, I will by all means tell this to the Blessed One.” The venerable Mahā­maudgalyāyana said to the Blessed One, “Honored One, the Blessed One once said, ‘Monks, fathers and mothers do what is quite difficult to do.’ My mother has been reborn in the Marīcika world and she is one who should be trained by the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་གདུལ་བར་གསོལ།
en: May the Blessed One have compassion and train her.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་སུའི་རྫུ་འཕྲུལ་གྱིས་དོང་།
en: “Maudgalyāyana, by whose magical power shall we go there?” asked the Blessed One.

source: བཅོམ་ལྡན་འདས་བདག་གིའོ།
en: “By mine, Blessed One.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་རི་རབ་ཀྱི་རྩེ་མོ་ལ་གོམ་པ་བོར་ཞིང་གཤེགས་པ་དང་། ཞག་བདུན་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་ཅན་དུ་བྱོན་ཏོ།
en: Then the Blessed One and the venerable Mahā­maudgalyāyana departed, stepping on the summit of Mount Sumeru, and arrived in the Marīcika world after seven days.

source: །བུ་མོ་བཟང་མོ་དེས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་རྒྱང་རིང་པོ་ཁོ་ན་ནས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དགའ་བ་དང་བཅས་པས་དེའི་དྲུང་དུ་སོང་སྟེ་སྨྲས་པ། ཀྱེ་མའོ་ཡུན་རིང་ཞིག་ལོན་ནས་བུ་མཐོང་ངོ་།
en: When she, Bhadrakanyā, saw the venerable Mahā­maudgalyāyana from a distance, she was delighted, and she went to him and said, “Ah, I see my son after so long!

source: །ཀྱེ་མའོ་ཡུན་རིང་མོ་ཞིག་ལོན་ནས་བུ་མཐོང་ངོ་།
en: Ah, I see my son after so long!”

source: །དེ་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོས་སྨྲས་པ། ཤེས་ལྡན་དག་རབ་ཏུ་བྱུང་བ་འདི་ནི་རྒན་ན་ཇི་ལྟར་བུ་མོ་འདི་དེའི་མ་ཡིན།
en: Then a large crowd asked, “Sirs, how is this girl the mother of this mendicant who is so old?”

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་སྨྲས་པ། ཤེས་ལྡན་དག་ཁོ་བོའི་ལུས་འདི་འདིས་བསྐྱེད་དེ།
en: “Sirs,” replied the venerable Mahā­maudgalyāyana, “this woman bore this body of mine.

source: དེས་ན་ཁོ་བོའི་མ་ཡིན་ནོ།
en: Thus, she is my mother.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བུ་མོ་བཟང་མོ་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པའི་འཕགས་པའི་བདེན་པ་བཞི་རྟོགས་པར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་དེ།
en: The Blessed One knew Bhadrakanyā’s thinking, proclivity, disposition, and nature, and preached the Dharma that was appropriate for her and that caused her to penetrate the four truths of the noble ones.

source: དེ་ཐོས་ནས་བུ་མོ་བཟང་མོ་དེས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: When Bhadrakanyā had heard the Dharma, she leveled the twenty high peaks of the mountain chain of the false view of individuality with the vajra of knowledge and actualized the fruit of stream-entry.

source: དེས་བདེན་པ་མཐོང་ནས་ལན་གསུམ་དུ་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ་ཞེས་བྱ་བ་ནས་ལྷ་དང་མི་རྣམས་སུ་རབ་ཏུ་བཞག་ཅེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ། །ཡང་སྨྲས་པ།
en: After she had seen the truths, she spoke an inspired utterance three times: “. . . you placed me among gods and humans.” Again, she said:

source: ཉེས་པ་མང་པོར་ལྡན་པས་མི་བཟད་པའི། །ངན་སོང་ལམ་ནི་ཁྱོད་ཀྱི་མཐུས་བཅད་དེ།
en: “The terrible path to inferior states of existence, With their many dangers, was closed by you.

source: །མཐོ་རིས་འགྲོ་བ་བསོད་ནམས་བཟང་ལྡན་ཕྱེ།
en: The path to the heavens, with their excellent merits,

source: །མྱ་ངན་འདས་པའི་ལམ་ཡང་བདག་གིས་ཐོབ།
en: Was opened, and I found the path to nirvāṇa.

source: །ཁྱེད་ལ་བརྟེན་ནས་ཤིན་ཏུ་རྣམ་དག་མིག །ཉེས་དང་བྲལ་བས་དག་པ་དེང་འདིར་ཐོབ།
en: “Supported by you, I acquired the pure eye That is extremely pure and free from fault.

source: །འཕགས་པ་དགྱེས་པའི་གོ་འཕང་ཞི་ཐོབ་ནས།
en: After obtaining the pacified state that pleases the noble ones,

source: །སྡུག་བསྔལ་རྒྱ་མཚོའི་ཕ་རོལ་བདག་གིས་རྒལ།
en: I will cross over to the far shore beyond the ocean of suffering.

source: །འགྲོ་བར་ལྷ་མིན་ལྷ་དང་མིས་མཆོད་པ།
en: “O, you who are venerated by the gods and humans of this world,

source: །སྐྱེ་རྒ་འཆི་དང་ནད་དང་རྣམ་བྲལ་བ།
en: Who is free from birth, old age, illness, and death,

source: །སྲིད་པ་སྟོང་དུ་མཐོང་བ་རྙེད་དཀའ་བ།
en: Muni who is hard to see even should we be reborn a thousand times,

source: །ཐུབ་པ་ཁྱོད་མཐོང་དེང་འདིར་འབྲས་བུར་བཅས།
en: My encounter with you bore fruit right here and now.

source: །བཙུན་པ་བདག་ནི་འཕགས་ཤིང་མངོན་པར་འཕགས་ཏེ།
en: “I am exalted, truly exalted.

source: བདག་བཅོམ་ལྡན་འདས་དང་ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ།
en: Since I seek refuge in the Blessed One, the Dharma, and the community, may you accept me as a lay sister.

source: །དེང་སླན་ཆད་ཇི་སྲིད་འཚོའི་བར་དུ་བསམ་པ་ཐག་པས་སྐྱབས་སུ་མཆི་བར་མངོན་པར་སྤྲོ་ལགས་སོ།
en: From today onward, I embrace my faith as one who seeks refuge throughout my life.

source: །བཅོམ་ལྡན་འདས་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་དེང་བསོད་སྙོམས་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Blessed One and Mahā­maudgalyāyana, please assent to my offer of a meal today.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བུ་མོ་བཟང་མོ་དེ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to Bhadrakanyā’s request by remaining silent, and Bhadrakanyā understood the Blessed One’s assent.

source: །དེ་ནས་བུ་མོ་བཟང་མོས་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་བར་རིག་སྟེ། བཅོམ་ལྡན་འདས་དང་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་གདན་ལ་བདེ་བར་བཞུགས་པར་རིག་ནས། གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་བཅའ་བ་དག་རང་གི་ལག་ནས་སྟོབས་ཤིང་ཚིམ་པར་བྱེད་དེ།
en: Then Bhadrakanyā knew that the Blessed One and the venerable Mahā­maudgalyāyana had sat down in comfort, and with her own hands she served and satisfied them with a pure and fine meal.

source: རྣམ་གྲངས་དུ་མར་གཙང་ཞིང་བསོད་པའི་བཟའ་བ་དང་། བཅའ་བ་དག་རང་གི་ལག་ནས་བསྟབས་ཤིང་ཚིམ་པར་བྱས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་གསོལ་ཟིན་ནས་ཕྱག་གཉིས་བཅབས་ཏེ། ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་སྟན་དམའ་བ་ཞིག་བླངས་ཏེ།
en: When she had, with her own hands, served and satisfied them in a variety of ways with a pure and fine meal, knowing that the Blessed One had finished his meal and washed his hands and his bowl, she took a low seat and sat before the Blessed One in order to hear the Dharma.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བཏིང་ནས་ཆོས་མཉན་པའི་ཕྱིར་འདུག་པ་དང་། དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་བཤད་དོ།
en: The Blessed One then preached the Dharma to Bhadrakanyā.

source: །བཅོམ་ལྡན་འདས་ཀྱི་ལྷུང་བཟེད་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བླངས་ཏེ་ལྷུང་བཟེད་འཁྲུ་བར་བྱེད་པ་ན། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་འདོང་ངམ།
en: When the venerable Mahā­maudgalyāyana had taken the Blessed One’s bowl and washed it, the Blessed One said, “Maudgalyāyana, shall we go?”

source: བཅོམ་ལྡན་འདས་གཤེགས་སོ།
en: “Blessed One, let us go.”

source: །སུའི་རྫུ་འཕྲུལ་གྱིས།
en: “By whose magical power?”

source: བཅོམ་ལྡན་འདས་ཀྱིའོ།
en: “The Blessed One’s, please.”

source: །གལ་ཏེ་དེ་ལྟ་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་སོམས་ཤིག །བཅོམ་ལྡན་འདས་སྐོལ་བྱོན་ལགས་སམ།
en: “Then think about the Jetavana.” “Blessed One, have we already arrived there?”

source: མཽད་གལ་གྱི་བུ་ཡུ་བུ་ཕྱིན་ཟིན་ནོ།
en: “We have arrived, Maudgalyāyana.”

source: །དེ་ནས་ངོ་མཚར་དུ་དད་པའི་ཡིད་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་རྫུ་འཕྲུལ་འདིའི་མིང་ཅི་ལགས།
en: The venerable Mahā­maudgalyāyana was astonished and asked, “Blessed One, what is the name of this magical power?”

source: མཽད་གལ་གྱི་བུ་ཡིད་མགྱོགས་ཡིན་ནོ།
en: “Maudgalyāyana, it is called manojavā (“swift as thought”).”
